In [1]:
import pandas as pd

In [2]:
df01 = pd.DataFrame( {'氏名':['高橋', '伊藤', '鈴木', '佐藤'],
                      'クラス':['a001', 'a001', 'a001', 'a001'],
                      '数学':[1, 2, 3, 4]})
df01

   氏名   クラス  数学
0  高橋  a001   1
1  伊藤  a001   2
2  鈴木  a001   3
3  佐藤  a001   4

In [3]:
df02 = pd.DataFrame( {'氏名':['高橋', '伊藤', '鈴木', '佐藤'],
                      'クラス':['a001', 'a001', 'a001', 'a001'],
                      '国語':[5, 6, 7, 8]})
df02

   氏名   クラス  国語
0  高橋  a001   5
1  伊藤  a001   6
2  鈴木  a001   7
3  佐藤  a001   8

In [4]:
# mergeでonで指定したものをもとに、結合
pd.merge(df01, df02, on='氏名')

   氏名 クラス_x  数学 クラス_y  国語
0  高橋  a001   1  a001   5
1  伊藤  a001   2  a001   6
2  鈴木  a001   3  a001   7
3  佐藤  a001   4  a001   8

In [5]:
# suffixes でmerge時に　コラム名を指定してつなげる
pd.merge(df01, df02, on='氏名', suffixes=['_left', '_right'])

   氏名 クラス_left  数学 クラス_right  国語
0  高橋     a001   1      a001   5
1  伊藤     a001   2      a001   6
2  鈴木     a001   3      a001   7
3  佐藤     a001   4      a001   8

In [6]:
pd.merge(df01, df02, on='氏名', suffixes=['', '_重複'])

   氏名   クラス  数学 クラス_重複  国語
0  高橋  a001   1   a001   5
1  伊藤  a001   2   a001   6
2  鈴木  a001   3   a001   7
3  佐藤  a001   4   a001   8

In [7]:
df02_name = pd.DataFrame( {'名前':['高橋', '伊藤', '鈴木', '佐藤'],
                      'クラス':['a001', 'a001', 'a001', 'a001'],
                      '国語':[5, 6, 7, 8]})
df02_name

   名前   クラス  国語
0  高橋  a001   5
1  伊藤  a001   6
2  鈴木  a001   7
3  佐藤  a001   8

In [8]:
# コラム名が違っていても、下のように指定して結合可能
pd.merge(df01, df02_name, left_on='氏名', right_on='名前')

   氏名 クラス_x  数学  名前 クラス_y  国語
0  高橋  a001   1  高橋  a001   5
1  伊藤  a001   2  伊藤  a001   6
2  鈴木  a001   3  鈴木  a001   7
3  佐藤  a001   4  佐藤  a001   8

In [9]:
df03 = pd.DataFrame( {'名前':['高橋', '高橋'],
                      'クラス':['a001', 'a002'],
                      '英語':[15, 16]})
df03

   名前   クラス  英語
0  高橋  a001  15
1  高橋  a002  16

In [10]:
# 氏名とクラス、名前とクラスで、それぞれ同じものと結合
pd.merge(df01, df03, left_on=['氏名','クラス'], right_on=['名前','クラス'])

   氏名   クラス  数学  名前  英語
0  高橋  a001   1  高橋  15

In [13]:
df01

   氏名   クラス  数学
0  高橋  a001   1
1  伊藤  a001   2
2  鈴木  a001   3
3  佐藤  a001   4

In [11]:
df04 = pd.DataFrame( {'氏名':['高橋','伊藤','渡辺','加藤'],
                      'クラス':['a001','a001','a001','a001'],
                      '国語':[5, 6, 7, 8]})
df04

   氏名   クラス  国語
0  高橋  a001   5
1  伊藤  a001   6
2  渡辺  a001   7
3  加藤  a001   8

In [12]:
# 左のデータがベース(結合時、左はすべて残る)
pd.merge(df01, df04, on='氏名', how='left')

   氏名 クラス_x  数学 クラス_y   国語
0  高橋  a001   1  a001  5.0
1  伊藤  a001   2  a001  6.0
2  鈴木  a001   3   NaN  NaN
3  佐藤  a001   4   NaN  NaN

In [14]:
# 右がベース
pd.merge(df01, df04, on='氏名', how='right')

   氏名 クラス_x   数学 クラス_y  国語
0  高橋  a001  1.0  a001   5
1  伊藤  a001  2.0  a001   6
2  渡辺   NaN  NaN  a001   7
3  加藤   NaN  NaN  a001   8

In [15]:
# outerで共通項以外も結合時に消えずに出力
pd.merge(df01, df04, on='氏名', how='outer')

   氏名 クラス_x   数学 クラス_y   国語
0  高橋  a001  1.0  a001  5.0
1  伊藤  a001  2.0  a001  6.0
2  鈴木  a001  3.0   NaN  NaN
3  佐藤  a001  4.0   NaN  NaN
4  渡辺   NaN  NaN  a001  7.0
5  加藤   NaN  NaN  a001  8.0

In [18]:
# 元のデータフレームの情報を開示
pd.merge(df01, df04, on='氏名', how='outer', indicator=True)

   氏名 クラス_x   数学 クラス_y   国語      _merge
0  高橋  a001  1.0  a001  5.0        both
1  伊藤  a001  2.0  a001  6.0        both
2  鈴木  a001  3.0   NaN  NaN   left_only
3  佐藤  a001  4.0   NaN  NaN   left_only
4  渡辺   NaN  NaN  a001  7.0  right_only
5  加藤   NaN  NaN  a001  8.0  right_only

In [17]:
# inner で共通項のみ出力
pd.merge(df01, df04, on='氏名', how='inner')

   氏名 クラス_x  数学 クラス_y  国語
0  高橋  a001   1  a001   5
1  伊藤  a001   2  a001   6

In [19]:
df05 = pd.DataFrame({'クラス':['a001','a001','a001','a001'],
                     '数学':[1, 2, 3, 4]},
                    index=['高橋','伊藤','鈴木','佐藤'])
df05

     クラス  数学
高橋  a001   1
伊藤  a001   2
鈴木  a001   3
佐藤  a001   4

In [20]:
df02

   氏名   クラス  国語
0  高橋  a001   5
1  伊藤  a001   6
2  鈴木  a001   7
3  佐藤  a001   8

In [24]:
# 左のデータフレームのインデックスと右のデータフレームの氏名をキーに結合
pd.merge(df05, df02, left_index=True, right_on='氏名')

  クラス_x  数学  氏名 クラス_y  国語
0  a001   1  高橋  a001   5
1  a001   2  伊藤  a001   6
2  a001   3  鈴木  a001   7
3  a001   4  佐藤  a001   8

In [26]:
# 結合したデータフレームを結合キーでソートして表示(df05(index) と df02(氏名) の結合キーの昇順で並べる)
pd.merge(df05, df02, left_index=True, right_on='氏名', sort=True)

  クラス_x  数学  氏名 クラス_y  国語
1  a001   2  伊藤  a001   6
3  a001   4  佐藤  a001   8
2  a001   3  鈴木  a001   7
0  a001   1  高橋  a001   5